import type { Sozluk } from '../tr';

export const tarih: Sozluk['tarih'] = {
  gunler: ['星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六'],
  gunlerKisa: ['周日', '周一', '周二', '周三', '周四', '周五', '周六'],
  aylar: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
  aylarYalin: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
  aylarKisa: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
  haftaHarfleri: ['一', '二', '三', '四', '五', '六', '日'],
  uzun: '{yil}年{ay}{gun}日',
};
